tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Tools
cask "hammerspoon"
cask "imageoptim"
brew "coreutils"
brew "findutils"
brew "jq"
brew "lastpass-cli", args: ["with-pinentry"]
brew "less"
# Source-code syntax highlighter
brew "source-highlight"
brew "lesspipe"

brew "parallel"
brew "renameutils"

brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
brew "xmlstarlet"

brew "curl"
brew "wget"

brew "tmux"

cask "bit-slicer"
cask "deluge"

# Terminals
cask "kitty"
cask "iterm2"


# Git!
brew "git"
brew "git-extras"
brew "git-now"
brew "git-town"
brew "hub"

# Languages
brew "go"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
brew "python"
brew "nodenv"
brew "rbenv"
cask "java8"

# Misc. Libraries
brew "icu4c"
brew "readline"

# ZSH
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"

tap "linode/cli"
brew "linode/cli/linode-cli"

tap "thoughtbot/formulae"
brew "thoughtbot/formulae/rcm"

# CTAGS
tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Replaces proselint, write-good, and joblint.
# A customizable, syntax-aware linter for prose.
tap "valelint/vale"
brew "valelint/vale/vale"

# Writing
brew "alexjs"
brew "redpen"

# Editors
brew "editorconfig"
brew "neovim"
cask "oni"

# Screen Savers
cask "aerial"

# Chatting
cask "discord"
cask "gitter"
cask "slack"
